In [20]:
# Re-run this cell 
import pandas as pd

# Read in the data
schools = pd.read_csv("schools.csv")

# Preview the data
schools.head()

# Start coding here...
# Add as many cells as you like...

                                         school_name  ... percent_tested
0  New Explorations into Science, Technology and ...  ...            NaN
1                               Essex Street Academy  ...           78.9
2                       Lower Manhattan Arts Academy  ...           65.1
3    High School for Dual Language and Asian Studies  ...           95.9
4      Henry Street School for International Studies  ...           59.7

[5 rows x 7 columns]

In [ ]:
#Calculate top 10 schhols
best_math_schools = schools[schools['average_math'] * 100 / 800 >= 80]

best_math_schools = best_math_schools[["school_name", "average_math"]].sort_values("average_math", ascending=False)

In [22]:
best_math_schools

                                           school_name  average_math
88                              Stuyvesant High School           754
170                       Bronx High School of Science           714
93                 Staten Island Technical High School           711
365  Queens High School for the Sciences at York Co...           701
68   High School for Mathematics, Science, and Engi...           683
280                     Brooklyn Technical High School           682
333                        Townsend Harris High School           680
174  High School of American Studies at Lehman College           669
0    New Explorations into Science, Technology and ...           657
45                       Eleanor Roosevelt High School           641

In [23]:
#new_best_math_schools = best_math_schools.groupby("school_name")["average_math"].mean().sort_values(ascending=False)

In [24]:
#new_best_math_schools

In [25]:
schools["total_SAT"] = schools["average_math"] + schools["average_reading"] + schools["average_writing"]
top_10_schools =schools[["school_name","total_SAT"]].sort_values("total_SAT",ascending=False).head(10)
top_10_schools

                                           school_name  total_SAT
88                              Stuyvesant High School       2144
170                       Bronx High School of Science       2041
93                 Staten Island Technical High School       2041
174  High School of American Studies at Lehman College       2013
333                        Townsend Harris High School       1981
365  Queens High School for the Sciences at York Co...       1947
5                       Bard High School Early College       1914
280                     Brooklyn Technical High School       1896
45                       Eleanor Roosevelt High School       1889
68   High School for Mathematics, Science, and Engi...       1889

In [26]:
#find the largest_std_dev for top brorough and calculate number of schools
group_by_borough = schools.groupby("borough")["total_SAT"].agg(["count","mean","std"]).round(2)
largest_std_dev =group_by_borough[group_by_borough["std"] ==group_by_borough["std"].max()]
largest_std_dev =largest_std_dev.rename(columns={"count":"num_schools","mean":"average_SAT","std":"std_SAT"})
largest_std_dev.reset_index(inplace=True)
largest_std_dev

     borough  num_schools  average_SAT  std_SAT
0  Manhattan           89      1340.13   230.29